def not_read_m_l(people, mandatory_literature):
    people_not_read_m_l = set()
    for author in mandatory_literature:
        if author in read_literature:
            people_not_read_m_l |= set(read_literature[author])
    return people - people_not_read_m_l
        

people = {"Васильева В.М.", "Новиков С.В.", "Артемов А.И.",
          "Филиппова А.Н.", "Мартынова В.И.", "Романова С.М.", "Носков Г.B.",
          "Журавлева М.Е.", "Сойко В.В.", "Козлов С.Д."}

read_literature = {'Брэдбери Р. Каникулы':("Новиков С.В.", "Козлов С.Д.", "Сойко В.В."),
            'Гоголь Н. Ревизор':("Филиппова А.Н.", "Мартынова В.И.", "Романова С.М."),
            'Грин А. Алые паруса':("Артемов А.И."),
            'Куприн А. Изумруд':("Романова С.М.", "Васильева В.М."),
            'По Э. Лягушонок':("Журавлева М.Е.", "Сойко В.В.", "Васильева В.М.", "Новиков С.В."),
            'Свифт Д. Путешествия Гулливера':("Филиппова А.Н.", "Мартынова В.И.", "Романова С.М."),
            'Твен М. История с привидением': ("Козлов С.Д.", "Артемов А.И."),
            'Тургенев И. Ася':("Васильева В.М.","Романова С.М.", "Носков Г.B"), 
}

literature = {'Тургенев И. Ася', 'Пушкин А. Пиковая дама', 'Толстой Л. Детство', 
            'Гоголь Н. Ревизор', 'Куприн А. Изумруд', 'Чехов А. Переполох', 
            'Твен М. История с привидением', 'По Э. Лягушонок', 'Брэдбери Р. Каникулы',
            'Грин А. Алые паруса', 'Свифт Д. Путешествия Гулливера'}

mandatory_literature = {'Толстой Л. Детство', 'Гоголь Н. Ревизор', 'Куприн А. Изумруд', 'Твен М. История с привидением'}

print(not_read_m_l(people, mandatory_literature))